Autodesk.Revit.DB.PartMaker.SetSourceElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set the source elements for the PartMaker.
sourceElementIds:
Elements to be the sources for this PartMaker.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be a source for this PartMaker
Elements should be Parts that have no PartMaker yet
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMaker.IsSourceElement(Autodesk.Revit.DB.ElementId)
Is the element a source for this PartMaker
Returns:
Returns true if elemId is among the source elements of this PartMaker
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013